In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\miniconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\miniconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\miniconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\miniconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\miniconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

# Series object in one-dimensional labeled array

In [5]:
import pandas as pd

In [6]:
s1=pd.Series([1,2,3,4,5])

In [7]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

#Series can be indexed and change to its value

In [8]:
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

# We can also create a series object from a dict

In [9]:
s3=pd.Series({'a':10,'b':20,'c':30})
s3

a    10
b    20
c    30
dtype: int64

# We can change the index position

In [10]:
s4=pd.Series({'a':10,'b':20,'c':30},index=['b','c','d','a'])
s4

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

# Creating a dataframe

In [11]:
df1=pd.DataFrame({"Name":['Om','Dipal','Bibika','Rohan','Pradip','Kaizen','Anmol','Random1','Random2','Random3'],
                  "Marks":[98,97,96,95,94,90,85,99,78,88],
                  "addresses":['Satdobato','balkumari','kalanki','sitapaila','baneswor','sankhamul','balkhu','gwarko','maitighar','thapathali'],
                  "numbers":['9876567890','9858578353','9878765897','9860638254','9865783537','98757393532','9839035174','9087534285','9878786542','9087654678'],
                  "ages":[24,25,22,23,26,27,28,19,18,20]
                 })

In [12]:
df1.head()

     Name  Marks  addresses     numbers  ages
0      Om     98  Satdobato  9876567890    24
1   Dipal     97  balkumari  9858578353    25
2  Bibika     96    kalanki  9878765897    22
3   Rohan     95  sitapaila  9860638254    23
4  Pradip     94   baneswor  9865783537    26

In [13]:
df1.tail()

      Name  Marks   addresses      numbers  ages
5   Kaizen     90   sankhamul  98757393532    27
6    Anmol     85      balkhu   9839035174    28
7  Random1     99      gwarko   9087534285    19
8  Random2     78   maitighar   9878786542    18
9  Random3     88  thapathali   9087654678    20

In [14]:
df1.sample(6)

     Name  Marks  addresses      numbers  ages
5  Kaizen     90  sankhamul  98757393532    27
2  Bibika     96    kalanki   9878765897    22
1   Dipal     97  balkumari   9858578353    25
6   Anmol     85     balkhu   9839035174    28
0      Om     98  Satdobato   9876567890    24
3   Rohan     95  sitapaila   9860638254    23

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       10 non-null     object
 1   Marks      10 non-null     int64
 2   addresses  10 non-null     object
 3   numbers    10 non-null     object
 4   ages       10 non-null     int64
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [16]:
df1.describe()

           Marks       ages
count  10.000000  10.000000
mean   92.000000  23.200000
std     6.699917   3.425395
min    78.000000  18.000000
25%    88.500000  20.500000
50%    94.500000  23.500000
75%    96.750000  25.750000
max    99.000000  28.000000

In [17]:
df1.describe(include='all')

       Name      Marks  addresses     numbers       ages
count    10  10.000000         10          10  10.000000
unique   10        NaN         10          10        NaN
top      Om        NaN  Satdobato  9876567890        NaN
freq      1        NaN          1           1        NaN
mean    NaN  92.000000        NaN         NaN  23.200000
std     NaN   6.699917        NaN         NaN   3.425395
min     NaN  78.000000        NaN         NaN  18.000000
25%     NaN  88.500000        NaN         NaN  20.500000
50%     NaN  94.500000        NaN         NaN  23.500000
75%     NaN  96.750000        NaN         NaN  25.750000
max     NaN  99.000000        NaN         NaN  28.000000

In [18]:
df1.shape

(10, 5)

In [19]:
df1.dtypes

Name         object
Marks         int64
addresses    object
numbers      object
ages          int64
dtype: object

In [20]:
df1.memory_usage(deep=True)

Index        132
Name         546
Marks         80
addresses    572
numbers      591
ages          80
dtype: int64

In [21]:
df1.memory_usage(deep=True)/1024

Index        0.128906
Name         0.533203
Marks        0.078125
addresses    0.558594
numbers      0.577148
ages         0.078125
dtype: float64

In [23]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [24]:
df1.to_excel('Student.xlsx',index=False)

In [25]:
df1.to_csv('Student.csv',index=False)